# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [67]:
import numpy as np

In [6]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [8]:
# for finding the unique values

In [10]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [20]:
# if need to find no. of unique values below 2 menthods will give us desired output

In [16]:
len(df['col2'].unique())

3

In [18]:
df['col2'].nunique()

3

In [26]:
df['col2'].value_counts()    # here the value 444 appeared twice

col2
444    2
555    1
666    1
Name: count, dtype: int64

# conditional selection

In [33]:
df[df['col2']>490]

   col1  col2 col3
1     2   555  def
2     3   666  ghi

In [37]:
df[(df['col1']>1) & (df['col3'] == 'ghi')]

   col1  col2 col3
2     3   666  ghi

In [41]:
df[(df['col1']>1) | (df['col3'] == 'ghi')]

   col1  col2 col3
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [43]:
# Apply function

In [47]:
def times2(x):
    return x*2

In [49]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [53]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [57]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [79]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [81]:
df.apply(np.sum)

col1              10
col2            2109
col3    abcdefghixyz
dtype: object

In [83]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [85]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [87]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [89]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [95]:
df.sort_values('col2',axis=0)

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [97]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [99]:
# Drop rows with NaN Values
df.dropna()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [101]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [103]:
df.fillna('FILL')

   col1   col2 col3
0   1.0   FILL  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  FILL  444.0  xyz

In [105]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [107]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [109]:
df.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN